In [1]:
#Pandas podstawy - nauka (przygotowanie pliku)
#impotrowanie bibliotek
import numpy as np
import pandas as pd
# wyrzuca nam wykresy interaktywne na ekran
# import plotly.graph_objects as go
# import plotly.offline as pyo # rendering do pliku html
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# wczytanie pliku w CSV (biblioteka pd) 
df = pd.read_csv(R'C:\Users\user\Desktop\StudiaPodyplomow_DataScience_Python\4Wizualizacjaieksploracjadanych\iris.csv')
# df = pd.read_csv(R'C:\Users\user\Desktop\StudiaPodyplomow_DataScience_Python\4Wizualizacjaieksploracjadanych\Efektywnosc.csv')

# wyrzuczenie danych na ekran , 5 obserwacji 
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [3]:
#wczytanie pliku excel 
#pip install xlsxwriter
#pip install xlrd
# df = pd.read_excel('faktury.xls', sheet_name = 'faktury')
# df.to_excel('output.xlsx',sheet_name='Sheet_name_1', engine='xlsxwriter')

In [42]:
df = pd.read_csv('napoje.csv' , delimiter=';')
df.head()

   mies   rok   pepsi  fanta   żywiec  okocim  regionalne    cola   lech
0     1  2001  108447   43302  186385   54301       45065  227013  56306
1     2  2001  105439   46711  168782   68131       43933  221115  67212
2     3  2001  111675   36029  172186   63104       46663  222812  67398
3     4  2001  113232   33659  172445   50871       45195  238631  57100
4     5  2001  110274   40853  174526   67924       47926  222963  65001

In [7]:
# sprawdznie jakie mamy kolumny w pliku 
df.columns

Index(['mies', 'rok', 'pepsi', 'fanta ', 'żywiec', 'okocim', 'regionalne',
       'cola', 'lech'],
      dtype='object')

In [8]:
# polecenie pokaże nam max wartość w kolumnie ; MIN() - minimum
df.max()

mies              12
rok             2016
pepsi         125202
fanta          55207
żywiec        188616
okocim         70664
regionalne     62510
cola          254776
lech           75540
dtype: int64

In [9]:
# polecenie pokaże nam średnią wartośc w kolumnie
df.mean()

mies               6.500000
rok             2008.500000
pepsi         111414.692708
fanta          43395.593750
żywiec        176803.380208
okocim         60679.833333
regionalne     48668.036458
cola          226389.468750
lech           61091.348958
dtype: float64

In [11]:
# opis zbioru danych - pokazuje nam skatystyki. nie mamy tu jednak kolumn nienumerycznych
# mean - srednia artmetyczna
# 50%  - mediana - polowa obserwacji jest wieksza od tej wartosci a druga polowa jest wieksza od tej wartosci
# 25%  - (centyle) -  25% obserwacji wpada miedzy min a 25% 
# 75%  - 75%  wpada miedzy min a 75% 
# std - odchylenie standardowe - czyli jak bardzo ta krzywa jest rozlegla. tj. czy jest plaska czy jest stroma
# jezeli mamy male odchylenie std to bedzie stromy pik (dane sa skumulowane obok sredniej) danych, jezeli bedzie duzo to bedzie bardziej plaskie
# jak szeroko wartości danej wielkości są rozrzucone wokół jej średniej. Im mniejsza wartość odchylenia tym obserwacje są bardziej skupione wokół średniej

df.describe()

,mies,rok,pepsi,fanta,żywiec,okocim,regionalne,cola,lech
count,192.000000,192.000000,192.000000,192.000000,192.000000,192.000000,192.000000,192.000000,192.000000
mean,6.500000,2008.500000,111414.692708,43395.593750,176803.380208,60679.833333,48668.036458,226389.468750,61091.348958
std,3.461078,4.621824,5399.065735,5209.659958,4641.824492,4707.448276,4105.883349,9515.508337,4976.587851
min,1.000000,2001.000000,96794.000000,23842.000000,163076.000000,47383.000000,40573.000000,198005.000000,49331.000000
25%,3.750000,2004.750000,108112.500000,39619.250000,173863.750000,58005.500000,45615.750000,220685.250000,57373.750000
50%,6.500000,2008.500000,110998.500000,43490.500000,176816.500000,61157.000000,48085.000000,225884.500000,61048.000000
75%,9.250000,2012.250000,114830.500000,46902.000000,180477.750000,64022.750000,50587.500000,232890.250000,64815.750000
max,12.000000,2016.000000,125202.000000,55207.000000,188616.000000,70664.000000,62510.000000,254776.000000,75540.000000

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 192 entries, 0 to 191
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   mies        192 non-null    int64
 1   rok         192 non-null    int64
 2   pepsi       192 non-null    int64
 3   fanta       192 non-null    int64
 4   żywiec      192 non-null    int64
 5   okocim      192 non-null    int64
 6   regionalne  192 non-null    int64
 7   cola        192 non-null    int64
 8   lech        192 non-null    int64
dtypes: int64(9)
memory usage: 13.6 KB

In [43]:
# dodanie nowej kolumny 
df['vintage'] = df['rok'].map(str) + df['mies'].map(str)

df.head()

,mies,rok,pepsi,fanta,żywiec,okocim,regionalne,cola,lech,vintage
0,1,2001,108447,43302,186385,54301,45065,227013,56306,20011
1,2,2001,105439,46711,168782,68131,43933,221115,67212,20012
2,3,2001,111675,36029,172186,63104,46663,222812,67398,20013
3,4,2001,113232,33659,172445,50871,45195,238631,57100,20014
4,5,2001,110274,40853,174526,67924,47926,222963,65001,20015

In [44]:
# usuniecie blednej kolumny
# nazwa kolumny , 1 - kasujemy kolumne, zapisanie zmian w df

df.drop('vintage', axis = 1, inplace = True)

In [32]:
df.head()

   mies   rok   pepsi  fanta   żywiec  okocim  regionalne    cola   lech
0     1  2001  108447   43302  186385   54301       45065  227013  56306
1     2  2001  105439   46711  168782   68131       43933  221115  67212
2     3  2001  111675   36029  172186   63104       46663  222812  67398
3     4  2001  113232   33659  172445   50871       45195  238631  57100
4     5  2001  110274   40853  174526   67924       47926  222963  65001

In [45]:
# dodanie kolumny
df.insert(0, 'vintage' , df['rok'].map(str) + df['mies'].map(str))

In [34]:
df.head()

,vintage,mies,rok,pepsi,fanta,żywiec,okocim,regionalne,cola,lech
0,20011,1,2001,108447,43302,186385,54301,45065,227013,56306
1,20012,2,2001,105439,46711,168782,68131,43933,221115,67212
2,20013,3,2001,111675,36029,172186,63104,46663,222812,67398
3,20014,4,2001,113232,33659,172445,50871,45195,238631,57100
4,20015,5,2001,110274,40853,174526,67924,47926,222963,65001

In [35]:
# sprawdzenie typow danych i zmiana daty(rok i mth) na znakowy
df.dtypes

vintage       object
mies           int64
rok            int64
pepsi          int64
fanta          int64
żywiec         int64
okocim         int64
regionalne     int64
cola           int64
lech           int64
dtype: object

In [46]:
# dodanie kolumny 
df['data']  = df['rok'].map(str) + '-' + df['mies'].map(str) + '-' + '01'

In [48]:
# przeformatowanie
df = pd.to_datetime(df['data'], format = '%Y-%m-%d', errors = 'raise')

In [55]:
df

0     2001-01-01
1     2001-02-01
2     2001-03-01
3     2001-04-01
4     2001-05-01
         ...
187   2016-08-01
188   2016-09-01
189   2016-10-01
190   2016-11-01
191   2016-12-01
Name: data, Length: 192, dtype: datetime64[ns]

In [ ]:
# pierwsze wykresy